src/cf/Catalogs/ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента</Name>
			<Comment>Настройки выгрузки/загрузки данных, имя объекта сохранено в связи с динамическим созданием прав и правил префиксации</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантИспользованияНастройки</Name>
					<Comment>Определяет предназначение настройки: загрузка или выгрузка</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ор_ВариантыИспользованияНастройки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрикладногоОбъекта</Name>
					<Comment>Справочник, Документ</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ор_ТипыПрикладныхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПрикладногоОбъекта</Name>
					<Comment>Имя документа, как оно указанно в метаданных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТабличнойЧасти</Name>
					<Comment>Имя табличной части, как оно указанно в метаданных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПрикладногоОбъекта</Name>
					<Comment>Представление документа, справочника, для отображения пользователю</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеТабличнойЧасти</Name>
					<Comment>Имя табличной части, для отображения пользователю</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиЗагрузкиВыгрузки</Name>
					<Comment>Настройки загрузки</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретСозданияНовыхЭлементов</Name>
					<Comment>Флаг Не создавать новых элементов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
					<Comment>Контрагенты</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>Настройка доступна для указанных контрагентов</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ор_ВариантыИспользованияНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ор_ВариантыИспользованияНастройки</Name>
			<Comment>Значение определяет предназначение настройки для выгрузки или для загрузки</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаДанных</Name>
					<Comment>Выгрузка данных</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаДанных</Name>
					<Comment>Загрузка данных</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента/Forms/ФормаГрупповойОбработки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Ссылка КАК Наименование
	|ИЗ
	|	Справочник.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента КАК ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента
	|ГДЕ
	|	НЕ ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.Предопределенный
	|	И НЕ ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ЭтоГруппа
	|	И ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ВариантИспользованияНастройки = ЗНАЧЕНИЕ(Перечисление.ор_ВариантыИспользованияНастройки.ЗагрузкаДанных)";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Таблица.Загрузить(Результат.Выгрузить());
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТаблицаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Актуализировать(Команда)
	Отбор = Новый Структура("Пометка", Истина);
	МассивСтрок = Таблица.НайтиСтроки(Отбор);
	
	ТекстСИзменениями = "";
	Если МассивСтрок.Количество() > 0 Тогда
		МассивНастроек = Новый Массив;
		Для Каждого Строка Из МассивСтрок Цикл
			МассивНастроек.Добавить(Строка.Наименование);
		КонецЦикла;
		ор_ЗагрузкаИзЭлектронныхДокументовВызовСервера.ВыполнитьГрупповуюОбработкуНастроекЗагрузки(МассивНастроек, ТекстСИзменениями);
	Иначе
		ТекстСообщения = "Не выбрано ни одной настройки";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	Если ТекстСИзменениями = "" Тогда
		ТекстСИзменениями = "Выбранные настройки Выгрузки/Загрузки данных обработаны успешно";
	КонецЕсли;
	
	Элементы.Таблица.Видимость = ЛОЖЬ;
	Элементы.ТекстИзменений.Видимость = ИСТИНА;
	Элементы.ФормаАктуализировать.Доступность = ЛОЖЬ;
	Элементы.УстановитьФлажки.Видимость = ЛОЖЬ;
	Элементы.СнятьФлажки.Видимость = ЛОЖЬ;
	
	ВывестиТекст(ТекстСИзменениями);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для Каждого Строка Из Таблица Цикл
		Строка.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для Каждого Строка Из Таблица Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВывестиТекст(Текст)
	ВыводимыйТекст = Справочники.ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.ПолучитьМакет("МакетВыводаРезультатовАктуализацииНастроекЗагрузки").ПолучитьТекст();
	ТекстИзменений = СтрЗаменить(ВыводимыйТекст, "%РезультатАктуализации%", СтрЗаменить(Текст, Символы.ПС, "<BR>"));
КонецПроцедуры

#КонецОбласти
